In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.2
2.2.3

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  7  6  7  5  5
1  5  1  3  6  5
2  6  8  3  2  6
3  2  6  6  4  9
4  9  7  5  3  2

In [3]:
df.loc[:, ::-1] #Membalik urutan kolom

   E  D  C  B  A
0  5  5  7  6  7
1  5  6  3  1  5
2  6  2  3  8  6
3  9  4  6  6  2
4  2  3  5  7  9

In [4]:
df.loc[::-1] #Membalik urutan baris

   A  B  C  D  E
4  9  7  5  3  2
3  2  6  6  4  9
2  6  8  3  2  6
1  5  1  3  6  5
0  7  6  7  5  5

In [5]:
df.loc[::-1].reset_index(drop=True) #Membalik urutan baris dan melakukan penyesuaian ulang index

   A  B  C  D  E
0  9  7  5  3  2
1  2  6  6  4  9
2  6  8  3  2  6
3  5  1  3  6  5
4  7  6  7  5  5

In [6]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.2
2.2.3

In [8]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  2  8  1  2  9
1  5  5  1  7  1
2  9  6  1  3  4
3  1  5  6  5  7
4  9  6  6  9  9

In [9]:
df.rename(columns={'C':'Hobi'}) #Mengganti nama (label) untuk sebuah kolom pada Data Frame

   A  B  Hobi  D  E
0  2  8     1  2  9
1  5  5     1  7  1
2  9  6     1  3  4
3  1  5     6  5  7
4  9  6     6  9  9

In [10]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'}) #Mengganti nama (label) untuk banyak kolom pada Data Frame

   Nama  Alamat  C  Kota  E
0     2       8  1     2  9
1     5       5  1     7  1
2     9       6  1     3  4
3     1       5  6     5  7
4     9       6  6     9  9

In [ ]:
import pandas as pd
print(pd.__version__)

2.3.2

In [18]:
n_rows = 30
n_cols = 4
cols = ['A', 'B', 'C', 'D']

df = pd.DataFrame(np.random.randn(n_rows, n_cols), columns=cols)

nan_mask = np.random.rand(n_rows, n_cols) < 0.2
df[nan_mask] = np.nan

df = df.reset_index()
df.head()

   index         A         B         C         D
0      0  0.951763 -1.258626       NaN -0.544756
1      1  1.783795  0.689732       NaN -1.389032
2      2       NaN       NaN  1.334613       NaN
3      3 -0.006372 -0.276329  1.199561 -1.781486
4      4 -0.019764 -0.469777  0.852839  0.549403

In [19]:
df = df.rename(columns={'index':'Z'})
df.head()

   Z         A         B         C         D
0  0  0.951763 -1.258626       NaN -0.544756
1  1  1.783795  0.689732       NaN -1.389032
2  2       NaN       NaN  1.334613       NaN
3  3 -0.006372 -0.276329  1.199561 -1.781486
4  4 -0.019764 -0.469777  0.852839  0.549403

In [20]:
df_backup = df.copy(deep=True)

In [21]:
df = df.dropna(axis='columns') 
df.head() #Menghapus (drop) setiap kolom yang mengandung missing values

   Z
0  0
1  1
2  2
3  3
4  4

In [22]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head() #Menghapus (drop) setiap baris yang mengandung missing values

   Z         A         B         C         D
3  3 -0.006372 -0.276329  1.199561 -1.781486
4  4 -0.019764 -0.469777  0.852839  0.549403
6  6 -1.302668  2.721209  0.140436  0.627195
7  7  0.205387 -1.170052  0.497162  0.259278
8  8 -0.294584  0.686541 -1.488172 -0.378992

In [23]:
df = df_backup.copy(deep=True)
df.isna().mean() #Persentase missing values untuk tiap kolom

Z    0.000000
A    0.266667
B    0.100000
C    0.233333
D    0.133333
dtype: float64

In [24]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head() #Menghapus (drop) setiap kolom yang mengandung missing values berdasarkan threshold

   Z         B
0  0 -1.258626
1  1  0.689732
2  2       NaN
3  3 -0.276329
4  4 -0.469777

In [25]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.2
2.2.3

In [26]:
data = {'A':[15, 15, 18, np.nan, 12], 
        'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [27]:
df['A'] #Mengenal Pandas Series

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [28]:
type(df['A'])

pandas.core.series.Series

In [29]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
df['A'] == df['B'] #Memeriksa kesamaan dengan operator ==

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [ ]:
df['A'].equals(df['B']) #Memeriksa kesamaan dengan method equals()

True

In [32]:
df1 = df.copy(deep=True)

df.equals(df1) #Memeriksa kesamaan antar dua Data Frame

True

In [ ]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True